In [58]:
dict={'a':'one','b':'two','c':3}

In [59]:
print(dict['a'])

one

# Converting Dictionary to Series

### Importing Series and Pandas

In [60]:
from pandas import Series

In [61]:
ser = Series(dict)

print(ser)

In [62]:
ser['a']

'one'

# Practice

##### Create dictionary of 5 elements and convert it into series and print the 4th value

In [63]:
dictP = {'a':'one','b':'two','c':'three','d':'four','e':'five'}

In [64]:
dictP

{'a': 'one', 'b': 'two', 'c': 'three', 'd': 'four', 'e': 'five'}

In [65]:
cvse = Series(dictP)

In [66]:
cvse

a      one
b      two
c    three
d     four
e     five
dtype: object

In [67]:
cvse['d']

'four'

# Converting dictionary to dataframe

# Data Frame

### Importing DataFrame

In [68]:
from pandas import DataFrame

In [69]:
dictDf = {'name':['ay','mn','as'],
         'age':['21','22','21'],
         'sal':['10000','12000','20000']}

In [70]:
dictDf

{'name': ['ay', 'mn', 'as'],
 'age': ['21', '22', '21'],
 'sal': ['10000', '12000', '20000']}

In [71]:
cvDf = DataFrame(dictDf)

In [72]:
cvDf

  name age    sal
0   ay  21  10000
1   mn  22  12000
2   as  21  20000

# Rearranging columns

### Syntax
####  DataFrame(var,columns=["order of keys"])

In [73]:
ordF = DataFrame(dictDf,columns=['age','sal','name'])

In [74]:
ordF

  age    sal name
0  21  10000   ay
1  22  12000   mn
2  21  20000   as

### Adding new column

In [75]:
addCol = DataFrame(dictDf,columns=['age','sal','name','ph.no'])

In [76]:
addCol

  age    sal name ph.no
0  21  10000   ay   NaN
1  22  12000   mn   NaN
2  21  20000   as   NaN

### Accessing a particular column

In [77]:
addCol['name']

0    ay
1    mn
2    as
Name: name, dtype: object

### ix - get row of x direction

In [78]:
#addCol.ix[2]

### iloc - get specific row

In [79]:
addCol.iloc[2]

age         21
sal      20000
name        as
ph.no      NaN
Name: 2, dtype: object

### Transpose

In [80]:
addCol = addCol.T

In [81]:
addCol

           0      1      2
age       21     22     21
sal    10000  12000  20000
name      ay     mn     as
ph.no    NaN    NaN    NaN

#### Revert

In [82]:
addCol = addCol.T

In [83]:
addCol

  age    sal name ph.no
0  21  10000   ay   NaN
1  22  12000   mn   NaN
2  21  20000   as   NaN

### Adding value to change NaN

In [100]:
addCol['ph.no']=9495434706

In [101]:
addCol

  age    sal name       ph.no
0  21  10000   ay  9495434706
1  22  12000   mn  9495434706
2  21  20000   as  9495434706

In [103]:
addCol['ph.no']=[9495434706, 7012251791,9744262595]

In [104]:
addCol

  age    sal name       ph.no
0  21  10000   ay  9495434706
1  22  12000   mn  7012251791
2  21  20000   as  9744262595

### Adding column and values

In [105]:
addCol['education']='MCA'

In [106]:
addCol

  age    sal name       ph.no education
0  21  10000   ay  9495434706       MCA
1  22  12000   mn  7012251791       MCA
2  21  20000   as  9744262595       MCA

#### Reindexing the Frame (Changing the column order)

In [108]:
addCol.reindex(columns=['name','age','sal','education','ph.no'])

  name age    sal education       ph.no
0   ay  21  10000       MCA  9495434706
1   mn  22  12000       MCA  7012251791
2   as  21  20000       MCA  9744262595

### Removing a row using drop()

In [109]:
newCol = addCol.drop(2)

In [110]:
newCol

  age    sal name       ph.no education
0  21  10000   ay  9495434706       MCA
1  22  12000   mn  7012251791       MCA

### Removing a Column

In [114]:
delCol = addCol.drop('name',axis=1)

In [115]:
delCol

  age    sal       ph.no education
0  21  10000  9495434706       MCA
1  22  12000  7012251791       MCA
2  21  20000  9744262595       MCA

## Creating a series using index

In [84]:
obj = Series([1,2,3,4,5])

In [85]:
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [96]:
obj = Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [97]:
obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [88]:
obj['a']

1

### reindex

In [98]:
obj = obj.reindex(['b','a','c','e','d'])

In [99]:
obj

b    2
a    1
c    3
e    5
d    4
dtype: int64

## Adding 2 series

In [138]:
seriesA = Series([3,4,5,6])
seriesB = Series([20,30,50,60])

In [117]:
seriesA+seriesB

0    23
1    34
2    55
3    66
dtype: int64

#### Character and integer

In [118]:
seriesA = Series(['a',4,5,6])
seriesB = Series([20,'b',50,60])

In [120]:
# seriesA+seriesB Cause error

#### Character only

In [121]:
seriesA = Series(['a','b','c'])
seriesB = Series(['d','e','f'])

In [122]:
seriesA+seriesB

0    ad
1    be
2    cf
dtype: object

## Adding DataFrames

In [123]:
dataA = DataFrame({'A':[1,3,4,5],'B':[20,30,40,50]})

In [124]:
dataA

   A   B
0  1  20
1  3  30
2  4  40
3  5  50

In [125]:
dataB = DataFrame({'A':[100,200,400,500],'B':[200,300,400,500]})

In [126]:
dataB

     A    B
0  100  200
1  200  300
2  400  400
3  500  500

In [127]:
dataA+dataB

     A    B
0  101  220
1  203  330
2  404  440
3  505  550

## Adding DataFrame with Series

In [133]:
seriesNew = Series([1,3],index=['A','B'])

In [134]:
seriesNew

A    1
B    3
dtype: int64

In [135]:
seriesNew+dataA

   A   B
0  2  23
1  4  33
2  5  43
3  6  53

In [136]:
seriesNew-dataA

   A   B
0  0 -17
1 -2 -27
2 -3 -37
3 -4 -47

## Sorting Index using sort_index()

In [139]:
seriesA

0    3
1    4
2    5
3    6
dtype: int64

In [140]:
seriesA.reindex([3,2,1,0])

3    6
2    5
1    4
0    3
dtype: int64

In [141]:
seriesA.sort_index()

0    3
1    4
2    5
3    6
dtype: int64